[[0,"<VicFrank> probably through vk custom games, the number 1 custom games community","Myll",1445140753],[1,"<BMD> you guys need to be less shit at everything","Noya",1445123760],[2,"<BMD-mobile> That guarantees they pee cache","DarkMio",1417388400.0],[3,"<DarkMio> What is the multiple of shitposter?","Perry",1417474800.0],[4,"<func_door> I'd tend to use \"they\" over \"he\" but I guess let's not pretend this room isn't a sausage fest","SQL",1417474800.0],[5,"Has anyone floated this idea past Gaben?, Dotagate","Noya",1417647600.0],[6,"Omg can you stfu arrogant pos. Each time valve announce something about custom game mode you have to write some shit about they are not doing it right. Get off your high horse - Serialloser, fedoratipper","DarkMio",1417906800.0],[7,"<BMD> i tend to be a cantankerous old coot","DarkMio",1417906800.0],[8,"<SinZ> ok it is working, its just cloudflare being a bitch","SinZ",1417906800.0],[9,"behind, of a thought. the an idea and an ideas are BulletProof, of offend, criticise,misunderstanding, ignorance.. This is the my thought, hire me to work, Parssamon, a Brazilian philosopher","Noya",1417906800.0],[10,"<Frota> LegendsOfDota/master f3a5652 ash47: Added hax to mess with those who annoy me on my server, ha ha","Perry",1418079600.0],[11,"<Aderum> \"2015 is a palindrome in Binary (11111011111) - What a time to be alive\"","Perry",1418079600.0],[12,"<Jexah> Pretty sure they synced dota 1 with dota 2 when d2 came out of beta","Noya",1418166000.0],[13,"<Ash47> ok, here are your instructions: Learn C#, make it yourself.","DarkMio",1418338800.0],[14,"<+SinZ> I have no idea why dafuq its broken <+SinZ> I don't C# much <@penguinwizzard> get glasses","penguinwizzard",1418338800.0],[15,"<SQL> \"poor mans survival kit\": salve, bottle and a gauntlet","DarkMio",1418338800.0],[16,"<DarkMio> I wouldn't even be mad if someone close to me is into fucking shoes. as long as he doesnt fuck my shoes, he can fuck any shoe he wants","Noya",1418425200.0],[17,"<BMD> there's like 4 ways and they all kind of suck","Noya",1418511600.0],[18,"I have no worries though, I have legal proof that the map ys my intellectual property, I wrote a thesis on it in 2013 and the document has been certified as authentic by a nothary public on 11th June, 2013.","Noya",1418511600.0],[19,"<func_door> a simplified particle generator would own bones. ||<penguinwizzard> func_door: no, that would be an animation tool. * ba dum tish *","Noya",1418598000.0],[20,"<Renol> unicode: つ ◕_◕ ༽つ ǝpoɔᴉun ɟɟᴉפ","SinZ",1418857200.0],[21,"\"Made placement of data-driven units in Hammer more robust\" Kappa - Valve in Workshop Tools Update","Noya",1418857200.0],[22,"\b<\bfunc_door\b>\b sometimes I just want to go sproink","SinZ",1419030000.0],[23,"<Rook> By the way, I had a dream last night that you lived in my neighborhood, BMD.","DarkMio",1423436400.0],[24,"\"Der Bass muss ficken.\" - Wolfgang Amadeus Mozart","DarkMio",1419030000.0],[25,"<BMD> maybe i can jump on the hate train, get a top reddit post about how valve killed my custom games tournament dreams, because of the trade shit","Noya",1419202800.0],[26,"<Myll> we're gaben's elves guys, making mods in the workshop to bring joy to russians","Noya",1419462000.0],[27,"<Dondo> so java is pretty good","Noya",1419375600.0],[28,"It's all fake, made in SFM with gui photoshopped in, tell me how LUA can make a hero skateboard? there's nothing http://www.lua.org/manual/5.1/manual.html - tetfigaro on its cake day","Noya",1419462000.0],[29,"ok so like that was a lot of word. all i haer d was suf maps . im drunk( nthnks belgium. ) so just do that. i elivfe in you. ok. bye merry christmas!! yeah yeha asdd that shit to your physics lyrbray and do whateveryh teyh fuck ok. gpood gifs.","Noya",1419462000.0],[30,"<BMD> some of wizards of Scaleform have told tales of it being possible to harness the power of the scaleform text box to capture text commands, however it is only legend","Noya",1419634800.0],[31,"<penguinwizzard>\tbeing a wizzard is better than being a wizard","Myll",1419634800.0],[32,"<+DarkMio>\t+report SQL for being SQL","Myll",1419634800.0],[33,"<Lunar> never seen he say something in the chat.. just like cymatt","DarkMio",1419721200.0],[34,"<func_door>\topen the site with a captcha to click on either burger or vodka","Myll",1420326000.0],[35,"<Ash47>\tI could literally masturbate to it and cum all over it","Myll",1420326000.0],[36,"<Noya> brb I have to hit my brother","Myll",1420930800.0],[37,"<BMD> 420 boys","Perry",1421017200.0],[38,"<penguinwizzard> I think they're valve, and upgrading would be stupid, so they'd do it.","Noya",1421017200.0],[39,"<BMD> i nmeant the one berfre iwth liek 5/11","DarkMio",1421276400.0],[40,"( ＾◡＾)っ✂╰⋃╯ NiP NiP","DarkMio",1421362800.0],[41,"<penguinwizzard> when you gotta reproduce, you gotta reproduce","Noya",1421449200.0],[42,"<BMD> christ i'm a lazy fuckward","Myll",1421535600.0],[43,"<Beaverino> LegendsOfDotarino/mastererino 76e5b27erino ash47: Updatederino optionserino modulerino","Perry",1421622000.0],[44,"<penguinwizzard> SQL: my sleep schedule is about as stable as the ruble","SQL",1421622000.0],[45,"<Beaverino> whicherino canerino cause therino errorerino panelserino to geterino \"stuckerino\"","Noya",1421622000.0],[46,"<BMD> local ang = math.min(math.max(RotationDelta(VectorToAngles(projForward), VectorToAngles(target)).y,-90),90) / BEND_RESISTANCE[proj.nType] - no comments, thanks, past BMD","Noya",1421622000.0],[47,"Dota is a source of multiple fistfights in in their district. Dota has influenced the youth to be violent/to gamble and to steal. - Pinoys","Noya",1421708400.0],[48,"<+Noya> Does reddit still hats matt? \"hats\" wasn't intentional LOL","jimmydorry",1421794800.0],[49,"<BMD> yeah i was fucking with that stuff, but it confused me so i got angry, and now i pretend it doesn't exist","penguinwizzard",1421794800.0],[50,"<BMD> Well i've been building a reflex map based on final destination from smash bros","jimmydorry",1421794800.0],[51,"<Perry> MOD made me do it","Noya",1421794800.0],[52,"<jetl> =memo Ash47 The only issue that needs fixing is you","DarkMio",1421881200.0],[53,"<SQL> i actually wish i was dumbo, that's one badass elephant","Noya",1421967600.0],[54,"<DarkMio> Prolog looks liek assembler, with less obfuscated commands.","Yoshi2",1421967600.0],[55,"<BMD> UltraNerd -- he doesn't just play games, but makes them","DarkMio",1422054000.0],[56,"kick noya, win ti5 - 14Niggerkiller88 on reddit after noya's team lost a reflex showmatch","SQL",1422054000.0],[57,"\b<\bNoya\b>\b <DarkMio> Dark Themes are so 2006.","SinZ",1422140400.0],[58,"<Myll> PATTACH_EYES_FOLLOW is the shit man, like if it was a dude, he'd be the coolest dude at the party","Noya",1422226800.0],[59,"<DarkMio> THE FUCKING FUCK INTERNET IS FULL OF FUCKING INTERNET FUCKING CSS","Perry",1422572400.0],[60,"<DarkMio> My dick is scared of you.","SQL",1422572400.0],[61,"[22:18] <Myll> the more i know the less i understand","Pizzalol",1422572400.0],[62,"<BMD> so your locusts were Derek Zoolander and could only turn left","Noya",1422658800.0],[63,"<BMD> i could totally see myself getting sucked into some game - even Dota","DarkMio",1422658800.0],[64,"<penguinwizzard> oh, turns out pitch is paid DLC - (answering a particle editor question)","Noya",1422658800.0],[65,"<SinZ> you dont have to speak to be in a conversation - 2015","SinZ",1422658800.0],[66,"<Ricochet> idling is the foundation of irc culture","Noya",1422658800.0],[67,"<Drakonis> how's modding, is it good yet, or its fifty shades of jicyphex?","Noya",1422745200.0],[68,"<Noya> DarkMio: Creator of the first and only standalone custom game video that earns money in Dota 2 history","DarkMio",1422745200.0],[69,"<DarkMio> no, there is the theoretical math hammer that will calculate you in boredom of doom and destruction","DarkMio",1422745200.0],[70,"<LIAM> wut, why is it green? im not a l33t hacker so i have no idea what is happening.","Noya",1422745200.0],[71,"Secret won't get Top 8. They're really weak right now. I talked to them and I know what's going on with performance and what not. They seem to be in a really rough spot. I think EG will do okay, probably one of the more stronger teams.","DarkMio",1422831600.0],[72,"\b<\bNoya\b>\b Renol's the peoples bot","DarkMio",1422831600.0],[73,"<DarkMio> Rabscuttle's the shitposters bot","Noya",1422831600.0],[74,"<SQL> i actually got into professional dota 2 sometime around there","DarkMio",1422831600.0],[75,"<penguinwizzard> bright colors for important stuff","DrTeaSpoon",1422831600.0],[76,"IN MD WILL ICH NICHT SCHLECHTER WEIL ICH DA SKILL HABE","DarkMio",1422918000.0],[77,"<Ricochet> my doto looks like an african village after ebola anyways","Emerald-",1422918000.0],[78,"<@jetl>\tgreat. this is wonderful","Myll",1423090800.0],[79,"<Ash47> FUCK DARK SUPREMO, I'll pack all his features into LoD, It will be Legends of Frota","Noya",1423090800.0],[80,"<+Noya>\tThis just in: Everyone owes Ash47 $322 for intellectual property","Myll",1423090800.0],[81,"<jimmydorry> drifter, I will trade you one unit of jetl friendship for five units of jimmydorry friendship (because they are not worth much)","Noya",1423090800.0],[82,"<RoyAwesome> is the guy who made reflex in this channel? because that gamemode looks fucking fun. (May 20, 2014)","Noya",1423090800.0],[83,"<BMD>\tand i'd prefer people not talk about running their \"my nigs\" server","Myll",1423177200.0],[84,"<+SinZ>\tWill you fucking shut up so I can go through my logs","Myll",1423177200.0],[85,"<SQL> im actually laughing | penguinwizzard has kicked SQL from #dota2mods (NO LAUGHING ALLOWED)","Noya",1423177200.0],[86,"* penguinwizzard has kicked Nickparker from #dota2mods (NO FREE PARKING)","DarkMio",1423263600.0],[87,"<Jicyphex> You're just talking a lot of bullshit right now with absolutely no idea or facts or anything behind it. This isn't how any of that happened at all, not even remotely close. But let's just keep rolling on the hate bandwagon.","DarkMio",1423350000.0],[88,"\"shows the potential of the tools\" - Bruno \"Bruno\" Carlucci after DAC showmatch of \"Invoker Warface\"","Noya",1423350000.0],[89,"Yeah, that guy's known for stealing, spewing bullshit about others and trying to promote his garbage. \"reflex has a lot of polish\", right. Dota heroes shooting powershots. The DAC custom game seemed far higher quality than almost all stuff on the workshop. - Leddit","Noya",1423350000.0],[90,"<penguinwizzard> I predict the winning team will match this regex: [EV]G","DarkMio",1423436400.0],[91,"<penguinwizzard> easter event: wraith king removed, jesus king added","DarkMio",1423436400.0],[92,"<jimmydorry> s2 removed for pressing ceremonial reasons","jimmydorry",1423436400.0],[93,"<penguinwizzard> try not programming in a disco","Perry",1423436400.0],[94,"<ricochet> But waiting for valve to fix bugs is like being a Jehovah's witness waiting for armaggedon","DarkMio",1423436400.0],[95,"<BMD> Crystal Maiden -> Crystal Meth Den","DarkMio",1423436400.0],[96,"<Jicyphex_> You do realize that both magical and physical armor was removed?","SinZ",1423522800.0],[97,"<BMD> ba-dum tsshh","jimmydorry",1423522800.0],[98,"<VoiDeD> no, because nobody knew anything about the game :-) :-)","jimmydorry",1423522800.0],[99,"<penguinwizzard> nah, don't make graves, they already made them in holdout, just copy them over","Noya",1423522800.0],[100,"<+jimmydorry> as cool as a penguin","penguinwizzard",1423522800.0],[101,"<penguinwizzard> was your friend cool? I'm pretty cool. That could be your correlation!","jimmydorry",1423522800.0],[102,"<+DarkMio> And everyone had a tasty shithole to lick.","penguinwizzard",1423522800.0],[103,"<leddit> How did Crystal Maiden get through that door so fast with 280 MS? ||<liddet> Her face is literally the mask of madness. http://i.imgur.com/H9nQahx.png","jimmydorry",1423609200.0],[104,"<leddit> Maiden of Icewrack? More like Maiden of Niceracks. ( ͡° ͜ʖ ͡°) Okthxbai","jimmydorry",1423609200.0],[105,"<func_door> remove aura indicators because they're too much visual clutter, add pets ~valve~","Noya",1423609200.0],[106,"\"When game is going full retard, you can only go with it. If you start going against it, if you start going half retard, you´re fucking done for.\" - n0tail","penguinwizzard",1423609200.0],[107,"<BMD> you're well on your way to an unplayable game mod, becuase we still can't have like 50 units.","Noya",1423695600.0],[108,"“Do you have any idea how hard it is to get two brown kids onto a plane with a giant sword?”","Noya",1423782000.0],[109,"<+BMD>\tyou can design all you want, but if it can't be done it's just masturbating","Myll",1423782000.0],[110,"Yeah... no, I don't think that the professional teams that are currently developing team-branded games are doing that for the sake of \"learning\".","Noya",1423782000.0],[111,"Regular Game of Dota + P2W Lone Druid Bear","Noya",1423868400.0],[112,"<BMD> because his asshole is so loose you could eat a steak in there and not get any shit on it","DarkMio",1423868400.0],[113,"<+hex_6>\thowever if you want your things to be exposed to the world you probably have to be a pearl on top of a giant turd mountain","Myll",1423868400.0],[114,"<zephyr> Do I have to upboat something yet? Or is that still haram by the reddit mullahs","Noya",1423868400.0],[115,"<BMD> reddit rules are basically whatever someone wants thnem to be, for whate4ver reason, sort of like laws in a banana republic","Noya",1423868400.0],[116,"<tet> ur balls shouldn't be chaotic","SQL",1423868400.0],[117,"\"You've downloaded your limit of custom games for the week! Would you like to purchase 400 ValveBucks™ to refresh your limit?\"","Noya",1423868400.0],[118,"<DarkMio> nothing is happening, you piece of shit, maybe my dick is happening, but thats it","Noya",1423954800.0],[119,"christ i have so much stuff it's ridiculous it's going to read like the warren report","Noya",1424041200.0],[120,"Most games modes right now are remakes of WC3 with a 1-2 man team and therefore a low quality.","Noya",1424041200.0],[121,"<Drakonis> just a word of advice: don't get involved with known community villain jicyphex - otherwise have fun","DarkMio",1424041200.0],[122,"<BMD> he's malfoy level villainy, that kind of pathetic sort of villain","Noya",1424041200.0],[123,"<BMD> the dude has a Crabb and Goyle - in vulturas and darkswordfis","DarkMio",1424041200.0],[124,"<Noya> \"On the day of July 5, a huge drama engulfed the #dota2mods community, and so began the legend of the infamous M.o.D. Jicyphex the 1st\"","DarkMio",1424041200.0],[125,"<+BMD>\toh god that chinese video playing is grosss. he just split a video file up into a .bmp per frame","Myll",1424127600.0],[126,"<Myll> really? u play piano BMD ? what don't u do... ||<BMD> go outside","Noya",1424127600.0],[127,"<+BMD>\twe need our resident german with reddit diplomatic immunity","Myll",1424214000.0],[128,"<tet> I don't need to debate with a redditless vote manipulator","Noya",1424300400.0],[129,"<Ash47> do you know what a HARD LINK is?","SQL",1424386800.0],[130,"<zed`> problem with learning python as your first language is that its python","Noya",1424386800.0],[131,"<DarkMio> well, there is a difference between \"learning\" and \"learning\"","Noya",1424386800.0],[132,"func_door: if u promote mods ingame u'll get shadowbanned from dota","wFX",1424386800.0],[133,"local ddl1x, ddl1y, ddl1z, ddl2x, ddl2y, ddl2z, ddlr, ddlg, ddlb = string.match(text, \"^-ddl%s+(-?%d+)%s+(-?%d+)%s+(-?%d+)%s+(-?%d+)%s+(-?%d+)%s+(-?%d+)%s+(%d+)%s+(%d+)%s+(%d+)\") -- REFLEX","Myll",1424386800.0],[134,"<zed`> Language dilemmas, career choices, work mishaps and bot spam - #dota2mods has it all","wFX",1424386800.0],[135,"I've been thinking, what if the shadowbans were actually an evil scheme by DarkMio to get all our future karma, using the MoD guys as scapegoats","Noya",1424473200.0],[136,"<Noya-> no way valve is making docs","DarkMio",1424559600.0],[137,"<jimmydorry> we are a PG9+ site","Noya",1424559600.0],[138,"<VoiDeD> Well respected redditor with 197 IQ here chiming in. Seeing as how you've got a number of viewers would it be too hard to maybe mention reddit, com? It's a place to discuss the latest in dank memes, atheism, my little pony and the friend zone.","Noya",1424559600.0],[139,"<Myll> 2/23/15 the day SQL does modding work","Noya",1424646000.0],[140,"\"Jesus' first miracle was bringing alcohol to a party.\"","DarkMio",1424646000.0],[141,"<func_door> In this moment I am euphoric. Not because of any phony keyvalue blessing, but because I am enlightened by my Lua.","SQL",1424646000.0],[142,"<Perry> am I this retarded? <BMD> you work for MoD","Noya",1424646000.0],[143,"<zed`>\tdont know about bitcoin but scaleform is awesome, im investing my time in exchange for impossible ideas and shattered dreams","Myll",1424646000.0],[144,"<BMD> it's great to hear anythinhg from valve but don't Oprah the shit otu of it","Noya",1424732400.0],[145,"<Noya> Drakonis_ gj cropping the Kappa face out","wFX",1424732400.0],[146,"<DarkMio> Everyone who did anything remotely on the workshop got messaged by Saltyphex. <Perry> Everyone who did anything of quality* <Perry> standards are actually pretty high","DarkMio",1424732400.0],[147,"BMD but you're asking the dumbest video game players in the world -- Dota custom games players -- to handle 24 spells","Rook",1424732400.0],[148,"Veni Vidi Vodka: Goethe was basically the penguinwizzard of writing.","DarkMio",1424732400.0],[149,"<wFX>\ti'm not fucking understanding nothing","Myll",1424818800.0],[150,"<+SQL>\tand i fuck metal bars","Myll",1424818800.0],[151,"<BMD> i'm jsut so good at shitposting || no one knows i'm actually retarded","wFX",1424818800.0],[152,"<zed`> BMD and me shall drink tea and listen to selena gomez while discussing scaleform perched upon a lonely hill graced by the soothing view of a picturesque town made in hammer","Noya",1424818800.0],[153,"<Drakonis> zed` and BMD sitting on a tree ||<Rook> m-o-d-d-i-n-g","Emerald-",1424818800.0],[154,"<Davoness> something i love about idling in this channel is that i get to hear so many words and phrases that ive never heard before in my life","Noya",1424905200.0],[155,"<zed`> in reality scaleform is piss easy but im whining because retarded","Noya",1424905200.0],[156,"<Emerald-> Bob reks sky","SQL",1425078000.0],[157,"\b<\bAsh47\b>\b *cums* YES! told you I was close ;)","SinZ",1425078000.0],[158,"<Yoshi2> what do you think about my art skills? http://i.imgur.com/v2lS2eF.png","SinZ",1425078000.0],[159,"<+Myll>\thmfd what does ur name stand for? <hmfd>\tHer Majesty's Fashion Designer","Myll",1425164400.0],[160,"<BMD> did a smiley face kill your father and rape your mother or something <BMD> because i missed that story","Myll",1425250800.0],[161,"@penguinwizzard DrTeaSpoon: android dota2, with asymmetrical dota 2 mod using spellibrary","wFX",1425250800.0],[162,"DrTeaSpoon Torn between messing around with spell library or working on my android game or working on my asymmeytrical dota 2 mod :\\","wFX",1425250800.0],[163,"<zed`> the next thing i commit is going to be a suicide","SQL",1425250800.0],[164,"<SinZ> can you get a dev with less cancer","Noya",1425337200.0],[165,"You have been kicked from #dota2mods by Renol (This isn't twitch chat)","Noya",1425337200.0],[166,"<@penguinwizzard> GaBeN[ru]: huh, that's odd...how are you restarting the map? ||<GaBeN[ru]> penguinwizzard yes ||<@penguinwizzard> GaBeN[ru]: _how_ are you restarting the map? ||<GaBeN[ru]> yes","zed",1425423600.0],[167,"<Jake_R> Srsly? Letting a bot join just to give a guy -1 karma on it? Wow, you're dedicated.","DarkMio",1425423600.0],[168,"<BMD> you do have a tendency to come off like an American on vacation Drakonis","DarkMio",1425423600.0],[169,"<wFX> i have a question about SF... Do i max raze or aura first? :3","Noya",1425510000.0],[170,"<BMD> i want to get off mr. noya's wild ride","SQL",1425510000.0],[171,"<jimmydorry_db> just use the jimmydorry rule of thumb. If jimmydorry can do it, anyone can.","Noya",1425596400.0],[172,"-Global- Next netsplit imminent, please make sure that your seat backs and tray tables are in their full upright position. Make sure your seat belt is securely fastened and get ready to ride.","Perry",1425596400.0],[173,"<SpiderNight> alex had forgot to put {} at the end of an ability that was empty so i spent an hour looking for it","wFX",1425596400.0],[174,"<zed`>\tselena gomez has to be #1 so it's 0-indexed","Myll",1425682800.0],[175,"<Cyborgmatt> but yeah fuck reddit","Noya",1425682800.0],[176,"<wFX> it's like annoying but helping ppl at same time, AND commiting something, AND make tutorials about it","Noya",1425855600.0],[177,"<BMD> i guess i need to start coaching people on courier madness excellence","Myll",1425855600.0],[178,"<Toraxxx> MoD making TI's custom game in 2 days, calling it now, pudge warfare","Noya",1425855600.0],[179,"<Markie> WC3 ports will get sunk soon","Noya",1425855600.0],[180,"<Perry> but what is the scope ||<penguinwizzard> Perry: http://pixelbedlam.co.uk/wp-content/uploads/2013/12/Snes-Super-scope-Picutre-Plastic-Bazooka-Nintendo-Rocket-Launcher.jpg","DarkMio",1425942000.0],[181,"<zed`> the only thing that flash takes is your soul","Noya",1425942000.0],[182,"<penguinwizzard> jimmydorry: what, is shadowban your trigger now?","SinZ",1426028400.0],[183,"<jimmydorry> SinZ: what, is GreyFace your trigger now?","jimmydorry",1426028400.0],[184,"just the IRC kids trashtalking again and pulling accusations out of their ass","Noya",1426028400.0],[185,"<Noya>\tI thought the sheep mode was crap though","Myll",1426028400.0],[186,"<BMD> not that i don't rule out us being dumb as a box of dead turtles","Noya",1426028400.0],[187,"<DarkMio> only jewish, greedy, living in exile, nazi germans do that","Noya",1426028400.0],[188,"<NEO> BMD Can you prevent hair loss?","BMD",1426374000.0],[189,"<NEO>\tStop thinking of me as a = Come take a","Myll",1426460400.0],[190,"<BMD> but don't get cocky until you've done something","jimmydorry",1426460400.0],[191,"<zed> at the end of the year i'll hold a raffle and the winner gets to meet selena gomez at my wedding. theres no limit to the number of tickets you can earn","Noya",1426460400.0],[192,"U reale piase of sheet","func_door",1426460400.0],[193,"<tet> standard markup language ||<BMD> i thought SML was Sexy Mexican Language","Myll",1426546800.0],[194,"<Waffl3x> Im just pretty good at thinking I guess","Noya",1426546800.0],[195,"<Waffl3x> basically I dont know any language well at all, I understand the thinking to program (to an extent)","DarkMio",1426546800.0],[196,"Every Dota Patch Ever: http://i.imgur.com/ETIfCU3.gif","DarkMio",1426546800.0],[197,"<LeagueOfLemmings> How can I get the path to the black Year Beast or Winter Wywern model? <Ricochet> *african-american","zed",1426633200.0],[198,"WC3 modding is (un)dead, SC2 modding is dead, DOTA 2 modding will never be alive. - Zwiebelchen","Pizzalol",1426633200.0],[199,"<func_door> but there's enough people out there whose brains completely freeze up when they have to type a semicolon or something","zed",1426633200.0],[200,"<jimmydorry> South Asia is basically just India, right?","penguinwizzard",1426719600.0],[201,"<Drakonis> i should do lots of things","Noya",1426806000.0],[202,"last time I checked, modders don't have quality control","Noya",1426892400.0],[203,"<Ricochet> who is brave enough to venture into the trench of reddit and come back with a sack of upvotes","Noya",1426978800.0],[204,"<MORPHEUS> With poultry, I figured, now I need to figure","BMD",1426978800.0],[205,"<BMD> ... before I put minimum size guards on it, you could resize it past the top left of the window and watch all the insides explode in weird ways ( ͡° ͜ʖ ͡°)","jimmydorry",1427065200.0],[206,"<aderum> i really like my ps4 <+DarkMio> For what is it good? <+DarkMio> I would've no use for it, sadly. <aderum> playing games? :p","Myll",1427151600.0],[207,"<NEO> I wish that would have the ability to fire when cast love spells like a shaker","Noya",1427151600.0],[208,"<Noya> I don't think this will go anywhere until you manage to proerply define your question and what do you need/want to do.","Myll",1427151600.0],[209,"<Davoness> the only thing ive devoloped is a use for the +ban command kek","Noya",1427238000.0],[210,"<NEO> BMD u see my bag report? <func_door> paper or plastic?","Davoness",1427238000.0],[211,"<Noya> chinese farmfest games are the best <Noya> to have as a programming music background","Myll",1427238000.0],[212,"what beef could a dota2 modder have with others who share the same passion?","Noya",1427324400.0],[213,"<penguinwizzard> and here I am with no idea what a skunk's anus tastes like","SinZ",1427324400.0],[214,"<BMD> you are supposed to talk to it on your desk to reason things out","kritth",1427324400.0],[215,"Noya frog with a skirt is ok","kritth",1427324400.0],[216,"<Rook> Sometimes I wish I had a prehensile penis, but alas, no.","Myll",1427410800.0],[217,"<Renol> Posting reddit links will get you shadowbanned","jimmydorry",1427410800.0],[218,"<Markie> dude I'm the idea cranker, man I crank out ideas, if you're bored and want to make something I can give you a few concepts","DarkMio",1427410800.0],[219,"func_door I didn't know who selena gomez was till now she looks like a little girl","kritth",1427410800.0],[220,"<Davoness> ACCEPT MY PENIS BMD","SQL",1427497200.0],[221,"Rook: The best I could come up with was Ninja Turtles: http://imgur.com/HlMJooB","Noya",1427497200.0],[222,"<Markie> what I meant was you should have redrawn the revolver and attempted a second suicide <Markie> because you suck","DarkMio",1427497200.0],[223,"<Markie> I'm changing my steam name to 14Niggerkiller88","Davoness",1427497200.0],[224,"<a_dizzle> Is there a bot here watching any custom game submissions or updates? Probably every custom game, there aren't that many updates in a day so it wont be spammy.","DarkMio",1427583600.0],[225,"<SQL> like those are longer than my penis","SinZ",1427583600.0],[226,"<BMD> i didn't subject myself to the horrors of vbscript for no reason","Noya",1427583600.0],[227,"<Toyoka> HI MY NAME IS uh... FUCK...","DarkMio",1427583600.0],[228,"I swear anyone who plays artillery for fun is a pedophilic neckbeard who just wants to jerk off to tank-related anime while playing.","Davoness",1427666400.0],[229,"Dun1007 As a custom game maker, I nominate BMD senpai for this year's Nobel Dota Prize","Noya",1427666400.0],[230,"<BMD> amateurs, my disorganization is like a black hole","jimmydorry",1427666400.0],[231,"<penguinwizzard> actually, I think my ping is higher than the total MMR of my team","penguinwizzard",1427666400.0],[232,"<jimmydorry> nah, I need to communicate with my comrades │ make good help, stronk empire ever lasting","SQL",1427666400.0],[233,"<zed> i couldve shown you a picture of my penis if you wanted to look at something miniature and funny","wFX",1427666400.0],[234,"<tet> asterisk me again sometime and we'll see who's guinsoo","Noya",1427752800.0],[235,"<DarkMio> SQL: I just let my huge german penis hanging - so who cares","Myll",1427752800.0],[236,"<tucker> s4 has his birthday today! ||<singsing> he s5 now","DarkMio",1427752800.0],[237,"<Noya> There has to be a better way but I was too lazy to find out, only needed 3 letters so I made them up","jimmydorry",1427839200.0],[238,"<kritth>\tRook there is 24/7 service called Noya :P","Myll",1427839200.0],[239,"<penguinwizzard> when you kill someone irl, it's not like the body suddenly TP's somewhere else","Noya",1427925600.0],[240,"<jacklarnes> so instead of telling me \"i read the particles\" why cant you tell me where you're finding this information <+BMD>\tin my fucking brain","Myll",1428098400.0],[241,"<Davoness> i like it in the butt","Perry",1428098400.0],[242,"A collection of al LX registered gamemodes and mods: http://steamcommunity.com/sharedfiles/filedetails/?id=419876116","DarkMio",1428184800.0],[243,"<Davoness> why does firefox correct \"pre-caching\" to \"pee-caching\" ||<Davoness> its like it knows BMD personally or something","Drakonis",1428271200.0],[244,"<Aleteh> shit on a canvas and call it art","SQL",1428271200.0],[245,"<Rook> Maybe you should contract MoD for it","Myll",1428271200.0],[246,"<SelenaGomez> i only heard about BMD's beautiful voice through stories passed on through generations","Noya",1428271200.0],[247,"<DarkMio> its like your rectum suddenly screams bloody murder: \"EJECT EJECT EJECT\"","Davoness",1428357600.0],[248,"<SelenaGomez> i dont think that bananas are a valid currency for buying ED, or whatever grows in vietnam","Myll",1428357600.0],[249,"<Davoness> i was born in the question marks year","SQL",1428357600.0],[250,"<DarkMio> This is not a fast fapping competition in being quoted","Noya",1428357600.0],[251,"ChanServ has quit (upgrade, brb)","Toyoka",1428444000.0],[252,"<Davoness> Why is this a quote?","jimmydorry",1428444000.0],[253,"<SelenaGomez> you may be misunderstanding the focus of my penis","SQL",1428444000.0],[254,"<DarkMio> fmv? <DarkMio> filmmovievideo?","zed",1428444000.0],[255,"You are highly unproffessional for someone who runs a website - \"Can't Stop the Hulkmania\"","Noya",1428530400.0],[256,"<Markie> because as you know, I'm an Advanced Sophisticated Speaker. or ASS for short","Noya",1428530400.0],[257,"<dx> doesn't crash on startup so i assume it works perfectly","SinZ",1428616800.0],[258,"<Davoness> i would sound like a constipated darkmio trying to pronounce that shit wtf","SinZ",1428616800.0],[259,"<Noya> GPM = Gabens Per Minute","DarkMio",1428616800.0],[260,"<tet> punch yourself in the dick and jump out your window","Myll",1428616800.0],[261,"<SelenaGomez>\ttet has no fingers, he types with his penis","Myll",1428616800.0],[262,"<SelenaGomez> who the fuck pronounces yacht as kwoh","SQL",1428616800.0],[263,"SQL you can explore or use the kittens there","Toyoka",1428616800.0],[264,"<gf> one sock is stuck and doesn't get washed. ||<DarkMayo> So it's ... russian socklette? ( ͡°╭͜ʖ╮͡° )","DarkMio",1428703200.0],[265,"<psychonic> nevermind ||<psychonic> i screwed up :>","BMD",1428789600.0],[266,"<Davoness> i know im just ||<Davoness> being stupid","RoyAwesome",1428876000.0],[267,"<Davoness> my stupidity made everyone stupid ||<Davoness> im contagious~~","SinZ",1428876000.0],[268,"<BMD> anyone who finds what these idiots have done remotely defensible can go fuck themselves with a rake","SQL",1428876000.0],[269,"<SQL-school> who are you <SQL-school> and why are you pretending to be my Uruguayan boyfriend","Davoness",1428876000.0],[270,"<Markie> is the dota 2 workshop tools using source 1 or 2","SQL",1428876000.0],[271,"<BMD> dunno, star citizen and erectile dysfunction seem like they would go hand in hand","zed",1428876000.0],[272,"<BMD> \"Source 2 will fix Source 2 misconceptions\"","DarkMio",1428876000.0],[273,"<DR-18> height from ground to air missiles seem like the stupidest fucking thing in the entire game looks as if the poor excuse","Noya",1428876000.0],[274,"<Noya> paralin have you seen our shitforum where I talk to myself","Myll",1428962400.0],[275,"<SQL> \"If they use adblock we'll fuck up their settings\" *inster jew laughing*","Aderum",1428962400.0],[276,"<Davoness> i mean duck soup is kinda worse than terrorism lets be honest here","SinZ",1428962400.0],[277,"<Rubscuttle> the he thou and as a thy and","Toyoka",1428962400.0],[278,"<DR-18> naw i probably am going to ask why people (or you) put up with this shit all","BMD",1429048800.0],[279,"<zed> i dont care whose penis is longer tbh, i just like to avoid talking about it in the public","BMD",1429048800.0],[280,"<DR-18> no longer exists is the day we could brutally murder one another in the name was just some generic awful cupcake but","Davoness",1429135200.0],[281,"<Aderum> noya nothing you say make any sense ♥","Noya",1429135200.0],[282,"<Markie> \"omg thanks idler2 cant believe i almost missed it\" - said no one ever","SinZ",1429135200.0],[283,"im pretty sure if you're in this channel then you're from reddit or at least have a reddit account","func_door",1429135200.0],[284,"<BMD> My nose is whistling when I breathe right now and it makes me laugh, which makes it whistle more. It seriously sounds like the slide whistle cartoon bomb drop sound","jimmydorry",1429221600.0],[285,"<Dun1007> my grandchildrens will be able to reduce ms down to 30 when our amphibian lord bathes us with light of tool update in distant future","Noya",1429221600.0],[286,"<BMD> the fucking cloud turtle from mario 64 didn't have to put up with this shit","Noya",1429308000.0],[287,"<BMD> and i started drinking brandy ||<BMD> so it's going to get named DickButt's Revenge in 3 hours","Myll",1429394400.0],[288,"\"this kid is power hungery . he loves to ban people who type emotes without giving any warning lmao , get in the real world mang.\" - maffff","SinZ",1429394400.0],[289,"<jimmydorry> That was the weirdest phone call I have ever had. It sounded like an alien on the other end of the line. \"I am ♪ ♫ ♬ and I saw your ♬ ♪ ♫ which we are hoping ♪ ♪ ♫ soon. Please let us ♫ ♫ ♫ when you ♬ ♪ ♬ ♪. Have a good day~\"","jimmydorry",1429480800.0],[290,"<pleb_5182>Why do you make the chat auto-connect jimmydorry-sama?    ||<jimmydorry> Cause no one would notice it otherwise?    <♥ Geo ♥> I wouldn't have noticed the chat if it didn't connect, honestly","jimmydorry",1429480800.0],[291,"<Noya> its kind of a lady drink ||<+SQL> fits for me then","Myll",1429480800.0],[292,"<Noya> I'd rather be an honest modder with inferior \"quality\" than be associated with assholes that go against everything that makes a community grow","Myll",1429480800.0],[293,"<BMD> i've been around so many religious leaders and internet sociopaths in my life ||<BMD> this guy is plain as day","Myll",1429480800.0],[294,"<BMD> HEY NOYA DO YOU REMEMBER WHAT WE DId ||<BMD> oh god caps","Myll",1429567200.0],[295,"\"Im sorry master what can I do appease you :d2naturesprophet:\" - just1st","SinZ",1429567200.0],[296,"\"permitting owners to root around in a tractor’s programming might lead to pirating music through a vehicle’s entertainment system.\" - John Deere","SinZ",1429567200.0],[297,"<DR-18> (-637 karma) is currently at 90 reports and will be shockproof waterproof dustproof and impact resistant to 6","Davonesss",1429567200.0],[298,"<BMD> thank god i didn't pay for it","jimmydorry",1429653600.0],[299,"<a_dizzle> I wish my mod would code itself","Noya",1429653600.0],[300,"<BMD> but ther'es so much playesteting to do <BMD> and my days are consumed by sharepoint <BMD> and my nights i sit sleepless longing to kill it <BMD> and make its children watch me do it","Myll",1429653600.0],[301,"<Markie> what about an intelligent discussion","DarkMio",1429826400.0],[302,"SirBelvedere is the golden autist no one deserves","Davoness",1429912800.0],[303,"< Perry> MOD is actually a valve department < Perry> but you didn't get this from me","penguinwizzard",1429912800.0],[304,"<BMD> thing was free, thing is no longer free in all cases <BMD> that's caused genocides in the past","Noya",1429999200.0],[305,"\b<\bDarkMio_Surface\b>\b bow down to your historical masters near greenwich","SinZ",1429999200.0],[306,"<+SinZ> yeah mio strips","penguinwizzard",1429999200.0],[307,"<DarkMio_Surface> im not even sorry","jimmydorry",1429999200.0],[308,"<BMD> i injected a tracking device into gabe's urethra","SQL",1429999200.0],[309,"<penguinwizzard> figuring out what \"self\" is is one of the great challenges of life","Noya",1429999200.0],[310,"<zed`> its not my fault im autistic \"your iq is below 90? here, have a medal zed\"","Noya",1430085600.0],[311,"<chinese mob character> Regardless of whoever's winning, you get to spam B-god. Foreigners are SO SMART","jimmydorry",1430085600.0],[312,"<Noya> fuck this brb buying a rubber dick","DarkMio",1430085600.0],[313,"<DarkMio> anal = anal","Perry",1430085600.0],[314,"<DarkMio> Every time I heard in Berlin the shattering sound of his dreams and the hype he built up for 10 minutes until his browser managed to open and load the blog.","Noya",1430085600.0],[315,"<DR-18> with the community throughout the year to teach folks how to run it like i did just sorta lay there and feel","Noya",1430172000.0],[316,"<Ricochet> i just cancelled my date so I could play around with the new patch","SQL",1430172000.0],[317,"\"I think players who get DDoS'd out of tournaments should be instantly disqualified with no chance to play another match until people start taking it seriously.\"","DarkMio",1430172000.0],[318,"<ESEX> \"Centaur Ultimate Now Lasts for as Long as Your Team Can Make the Centaur Ult Noise into the Mic\"","DarkMio",1430172000.0],[319,"\"We've done this because it's clear we didn't understand exactly what we were doing.\" -Valve, http://steamcommunity.com//games/SteamWorkshop/announcements/detail/208632365253244218","Noya",1430258400.0],[320,"<DarkMio> My algo prof starts ramming his cock up mah arse","Davoness",1430258400.0],[321,"ＴＨＲＥＥ ＨＵＮＤＲＥＤ ＡＮＤ ＴＷＥＮＴＹ ＴＷＯ ＤＯＬＬＡＲＳ","DarkMayo",1430258400.0],[322,"<+BMD> otherwise i wear them at work becuase with the glasses on i look like a mad genius <+BMD> and with them off i look like a homeless person that wandered in off the street","Myll",1430258400.0],[323,"<DR-18> because im a 21st century pc","Toyoka",1430344800.0],[324,"<BMD> I'm just slapping code with my dick at this point","jimmydorry",1430344800.0],[325,"<Toyoka> yea, fuck it","jimmydorry",1430344800.0],[326,"<+jimmydorry> TI5... 5, last good TI was TI3... 3, 5 - 3 = 2 which happens to be the best TI of all time... the only remaining TI is TI1. 2 + 1 = 3.... HL3 confirmed game to be played by all stars (built in sauce2)","penguinwizzard",1430431200.0],[327,"DarkMio> \"is money still flowing?\" \"yes\" \"okay we're done here.\" -volvo","Davoness",1430431200.0],[328,"<BMD> so it sticking your finger in your butthole ||<BMD> but you won't see me raving about it in IRC","Drakonis",1430604000.0],[329,"<Noya> don't ruin Dota2Mods ||<Noya> jk its already ruined","Myll",1430604000.0],[330,"<penguinwizzard> I admin like 8 solaris servers","SQL",1430604000.0],[331,"<Myll> i'll eat my shoe if it reaches 20M","Drakonis",1430604000.0],[332,"<DR-18> in the lx client, i will power","Davoness",1430690400.0],[333,"\b<\bSQL\b>\b Hey Aderum! Do you want to play with my balls?","SinZ",1430690400.0],[334,"\"can we get ranked low priority\" - leldit","Davoness",1430776800.0],[335,"<SQL> Guided User Interface, what the fuck does guided mean. is it like made for retards?","DarkMio",1430776800.0],[336,"<Aleteh> If you accidentally make waaay too hot food, dont go take a piss before washing your hands.. my dick is on fucking fire","SinZ",1430776800.0],[337,"<SelenaGomez> i have a friend that has a weird compulsion to spit on his dick whenever he takes a piss","Myll",1430776800.0],[338,"<VicFrank> if I was tony abbott I'd go missing at sea","Davoness",1430863200.0],[339,"<RoyAwesome> VALVE IS NOT HAMPERED BY SUCH TRIVIAL ISSUES AS SYNTAX ERRORS","DarkMio",1430863200.0],[340,"<Swadow> ProTip: They will not invite Newbee","jimmydorry",1430949600.0],[341,"<SinZ> not my fault that half the voiced people suck","Davoness",1430949600.0],[342,"<SelenaGomez> [...] among the channel retards","DarkMio",1431122400.0],[343,"<Davoness> im so lazy so i put shit like \"dot_damage_kunkka_pew_pew_niggers\" or some shit","Noya",1431208800.0],[344,"<Ash47> I'll think of you when I cum then ;) jimmydorry","SinZ",1431295200.0],[345,"<BMD> why do you think i do this weird nonsense ||<BMD> because it's less depressing than trying to build stuff that should be actually supported","Myll",1431468000.0],[346,"<jimmydorry> I sometimes forget who I am, and shit post using BMD's reddit account","VicFrank",1431468000.0],[347,"<RoyAwesome> oh god you guys accidentally quoted me being nice to someone... fuck","jimmydorry",1431468000.0],[348,"<BMD> seriously how is everyone in this channel worse than some siberian 9 year old","Myll",1431468000.0],[349,"If you brigaded and ask nicely for you to be unbanned, and say that you've learned your lesson, you will be given an unban. /u/Vulturas","Noya",1431554400.0],[350,"<DarkMio> we real true germans are known for our superiour minds, athletics and telepathic abilities.","Noya",1431554400.0],[351,"<DR-18> make stronk empire ever lasting","Davoness",1431640800.0],[352,"<BMD> doesn't mean you should be a cunt sandwich","Ash47",1431813600.0],[353,"<SinZ> DarkMio can you give some not-europe people botop plz, so we can stop ash spamming quotes?","jimmydorry",1431813600.0],[354,"<Toyoka> zed is the propogator of angry drunked rage coding","SQL",1432072800.0],[355,"<Toyoka> time to test out whether or not my tentacles work properly <Toyoka> spent like 3 hours trying to fix this fucking tentacle shit","Myll",1432159200.0],[356,"<BMD> he's a curmudgeonly old 14 year old <jet> i'm a curmudgeonly old 14 year old","RoyAwesome",1432245600.0],[357,"<Noya> u can quote me m8","SelenaGomez",1432245600.0],[358,"<BMD> original ideas aren't even a real thing","Noya",1432245600.0],[359,"<BMD> the dude who invented fire just ripped off lightning","SelenaGomez",1432245600.0],[360,"<Perry> mod rich as fuck since invoker warfare we can pay for our own tickets","Myll",1432332000.0],[361,"<SelenaGomez> i would do it the peasant way","Noya",1432418400.0],[362,"<DR-18> a redirect to valvesoftware.. thats a hardcore gaben","SQL",1432418400.0],[363,"<SinZ> oh you fucking whore valve","Noya",1432504800.0],[364,"<zed`> we can always tell noya to learn how to do it and then do it","Myll",1432504800.0],[365,"<Davoness> i mean fuck, pay me $500 bucks and ill teach you how to mod dota any day","Noya",1432591200.0],[366,"<TurtleOverseer> Thank you for hosting on a lego calculator from Australia, then proceding to call us homosexual","Noya",1432591200.0],[367,"<Perry> hereby you have my permission and if the society for Dutch language complains to you, just send them to me","Hewdraw",1432764000.0],[368,"<Cobe> Take off the fedora and hit the gym","DarkMio",1432764000.0],[369,"<Cobe> jicyphex - you've got dire AIDS","DarkMio",1432764000.0],[370,"<Baumi> What happens to a man, that he thinks to himself, \"I should really just speed up Dota\"?","Rook",1432850400.0],[371,"<jet> datadriven teaches character","Noya",1432850400.0],[372,"<Hewdraw> can we not use that command? ||<Rabscuttle> Personally I have no issues with this command","DarkMio",1432850400.0],[373,"<Emerald-> +markov bazinga <Rabscuttle> *rejoices and cries in spanish*","DarkMio",1432850400.0],[374,"<Rabscuttle> oh fuck offffffffffffffffffffffff","Emerald",1432850400.0],[375,"<+SQL> never alcghol avgian","Dun1007",1432936800.0],[376,"<Rabscuttle> 206: <NEO> I wish that would have the ability to fire when cast love spells like a shaker ||<NEO> Rabscuttle ok i try it","Rook",1433023200.0],[377,"<Davoness> navi =/= pro Kappa","SinZ",1433023200.0],[378,"<Noya> wait people still rate navi to be 1st/2nd on the eu qualis? wtf","SinZ",1433023200.0],[379,"<VicFrank> I always thought sql was a bot","DarkMio",1433023200.0],[380,"<Myll> my minds telling me no... ||<jimmydorry> but reddit is telling me yes","Noya",1433109600.0],[381,"<+BMD> i heard they were making it so that if you cum in your cd tray while thinking about your game mode idea and how sweet it is <+BMD> the beta tools will make it for you","Myll",1433109600.0],[382,"<+func_door> he's still in the helpdesk channel because that place has a better signal:noise ratio","Myll",1433196000.0],[383,"<+SQL> oh, what a beautful weather outside - perfect time to mod","Dun1007",1433196000.0],[384,"<DarkMio> Why not repopulating another channel instead of killing this one.","DarkMio",1433282400.0],[385,"<SinZ> I need \"You fucking what valve\" on a shirt, seriously","Noya",1433282400.0],[386,"<SelenaGomez> when s2 goes out ill have an excuse to dedicate myself to modding. 1. im shit at dota 2. s2 dropped","Noya",1433368800.0],[387,"<Noya> who wants to bet we get 4month 2w","SinZ",1433368800.0],[388,"<DarkMio> \"I am penguinwizzard, BMDs tampon\"","SQL",1433455200.0],[389,"\b<\bPerry\b>\b slaves writing kv files <Perry> MoD has like 500 ofcourse","SinZ",1433541600.0],[390,"<+SQL> i hate it when games act like they should","Dun1007",1433541600.0],[391,"<Rabscuttle> fuck your memes fuck all of that","Noya",1433628000.0],[392,"<Perry> just noticed soe has basically the same haircut I have","SQL",1433628000.0],[393,"<SQL> it's coming on the 11th","SinZ",1433714400.0],[394,"<a_dizzle> thermodynamics qq <penguinwizzard> can't be worse than using Valve's API","Noya",1433800800.0],[395,"<SinZ> valve being inconsistant is the key to things working","Noya",1433887200.0],[396,"<tet> some people believe that it is good to \"program\" \"computers\" by writing \"code\"","Noya",1434146400.0],[397,"<BMD> the onyl thing anyone wants is a trip back to ~2003 when they were 9 years old and getting high with their brother playing <insert random terrible wc3 mod here>","Myll",1434146400.0],[398,"<a_dizzle> Call of Duty: Reborn S2 <a_dizzle> Now with hats","Myll",1434405600.0],[399,"<Tams> I think those guys have too much work to do","SQL",1434405600.0],[400,"<zed`>\till give it a seven <zed`>\ta hard, wet seven where selena is a 10","Myll",1434405600.0],[401,"<Noya> On This Day, Reddit Declared http://puu.sh/irBMv/f6d25f22df.jpg","zed",1434405600.0],[402,"<Noya> \"Team BMD\" ||<Noya> \"Better Masters of Development\"","RoyAwesome",1434492000.0],[403,"<penguinwizzard> my mod is about crying when valve makes poor format decisions","Noya",1434492000.0],[404,"<@BMD> throw some alpha on it ||<@BMD> pretend it's in world space ||<@BMD> baby you got a stew going","Myll",1434492000.0],[405,"<@BMD> i just copy paste random stuff to IRC ||<@BMD> then assume everyone remembers i said it like 3 months later","Myll",1434492000.0],[406,"<Rabscuttle> implying secret fans have functioning brain cells","zed",1434578400.0],[407,"<penguinwizzard> make ||<penguinwizzard> woops, wrong terminal","Noya",1434578400.0],[408,"<Capruce> My favourite addition is the fact that levelling up by 25 levels doesnt deafen me","Noya",1434664800.0],[409,"<BMD> oh man i'm a god","Noya",1434664800.0],[410,"<+DarkMio> Ash47: please be nazi","penguinwizzard",1434664800.0],[411,"<penguinwizzard> WARNING: editing gender takes effect in real life, use at own risk","Noya",1434837600.0],[412,"<penguinwizzard> Bill: it's not _really_ css, or js, or html5 - it's sad mockeries thereof","DarkMio",1434837600.0],[413,"<Toyoka> never estimate valvetime","RoyAwesome",1434924000.0],[414,"<@BMD> CSS is one of those things (like most web crap) where you can easily fart your way to something, and then someone who understands CSS will come along and retch and vomit and cry in pain at the horror you created","Dun1007",1435010400.0],[415,"<Enjay> Back in the good ol' days Sorceresses were as good as prostitutes. Interchangeable, in fact.","func_door",1435183200.0],[416,"<SelenaGomez> Noya slaves? you mean, you have an excellent work opportunity for the young and upcoming brilliant minds, a privilege to work along one of the most talented modders of our time","Noya",1435183200.0],[417,"<jet> people that don't write dota addons will be shipped to azkaban","Noya",1435269600.0],[418,"<Rabscuttle> /r/DotA2: What happened to this? I was waiting for it. - from Yoloswagginator (80 comments, 365 karma)","Perry",1435269600.0],[419,"<Toyoka> or pretend you're fucking someone <Toyoka> or turn on porn really loud","Myll",1435356000.0],[420,"<Myll> guys if u want ur mod to get in top 10, just add memes","Noya",1435528800.0],[421,"<arhowk> have you ever been so high that you tried to enumerate over an object by enumerating each character of the name of the object","Noya",1435701600.0],[422,"<Toyoka> GIFS play in the dota client if you have a gif in your workshop page description :D - http://i.imgur.com/BwnZ58F.png","DarkMio",1435701600.0],[423,"<SinZ> Ash47 has more sex quotes on rabs than most people have quotes","DarkMio",1435701600.0],[424,"<+BMD> swear to god i'm going to wear gigantic speechbubbles attached to my face at TI","Myll",1436392800.0],[425,"<BMD> Scaleform is dead <BMD> long live scaleform!","Dun1007",1436392800.0],[426,"<Noya> navi is the worse, they just won because alliance was feeling like giving them a shot","zed",1436392800.0],[427,"BMD: who gives a shit aobut dota 1","OrangeSodaSmurf",1436392800.0],[428,"\b<\bRicochet\b>\b i personally blame the heat or the jewish conspiracy for my thoughtlessness","SinZ",1436479200.0],[429,"<ScOULaris> I'm American. I only speak American.","Noya",1436479200.0],[430,"<gumpello> how to avoid linearprojectitel ||<func_door> move out of the way","Noya",1436479200.0],[431,"<@BMD> they should have named them ability_crapfest ||<@BMD> or ability_waste_bmds_time","Myll",1436652000.0],[432,"<arhowk> are you friends with yourself?","Noya",1436911200.0],[433,"<func_door> what are you talking about this channel is a nonstop homolove orgy","SQL",1436911200.0],[434,"<BMD> where's my func_trains valve ||<BMD> why bother modding if i can't make my thomas the dank engine simulator","Myll",1436997600.0],[435,"<@BMD> what the fuck do you think the \"Target\" {} is ||<@BMD> it's literally a \"Target\" block {}","Myll",1437084000.0],[436,"<BMD> granted i read code like it's harry potter","Noya",1437084000.0],[437,"<VicFrank> oh wait no i'm an idiot pretend this didn't happen","Noya",1437429600.0],[438,"<BMD> did you stick your dick in the mashed potatoes and get caught","VicFrank",1437602400.0],[439,"<Aderum> what does the createspeedball function look like ||<Moop> heroin.mixWith(Cocain.getInstance());","SQL",1438120800.0],[440,"This is my quote now. Fuck off.","DarkMio",1438120800.0],[441,"<+SQL> What's better than winning gold at the special olympics? ||<@BMD> having JubilantMassiveCock for a gfycat link http://gfycat.com/JubilantMassiveCock","Myll",1438207200.0],[442,"<Markie> i had that issue on a hentai page yesterday","Perry",1438293600.0],[443,"<DarkMio> I believe I can write a nazi-crawler with high confidence datasets in a few days and visualize them","SQL",1438466400.0],[444,"<DarkMio> Where is TI? In Arena","SQL",1438552800.0],[445,"<DoctorGester> isn't it (C++) like a PHP but super complex","Perry",1438552800.0],[446,"<DoctorGester> Like I can't find the words to explain really but C# or Java are greatly designed for me","DarkMio",1438552800.0],[447,"<+Noya> he's dense, I'm guessing russian teen","Myll",1438639200.0],[448,"<sknz> lets say im building a map with a guy who has probably never even started the workshop tools on his own computer","Myll",1438725600.0],[449,"<DarkMio> You're worse than me, gj.","Noya",1438725600.0],[450,"<func_door> hey that quote is out of date","a_dizzle",1438812000.0],[451,"<gigimoi> how many bmds are in section 10?","Arhowk",1438898400.0],[452,"<VicFrank> look at that people doing the wave, they is bmd","Arhowk",1438898400.0],[453,"<gigimoi> kacy proposing to bmd","SQL",1438898400.0],[454,"<N0Tail_Kobb> 420BOOTYWIZARD","Arhowk",1438898400.0],[455,"<Tora> nobody here fking cares about custom games","VicFrank",1438898400.0],[456,"<bmd> this is not my lipstick","Arhowk",1438898400.0],[457,"<gigimoi> \"This is not my lipstick\" - BMD","SQL",1438898400.0],[458,"<gigimoi> if it's anything like ti then bmd.","Arhowk",1438898400.0],[459,"<BMD_gigimoi> \"going down on qop\" - bmd","SQL",1438984800.0],[460,"<BMD_Azarak> I AM AMERITARD AND I HAVE FREEDOM TO BE RETARDED","EG-Arhowk",1439071200.0],[461,"<radar> I don't know maybe im not watching the BMD trends correctly","SQL",1439071200.0],[462,"<BMD_gigimoi> population is growing and all are bmd, how can we lose bmds?","SQL",1439071200.0],[463,"<Ovujj> Have you ever farted in a greenhouse and made a greenhouse gasses joke","DarkMio",1439157600.0],[464,"<Aderum> \"Hi idiots, u made a bullshit. this is not normal pudge wars. omg ur hands grow from ass, u can't do normal mode.\"","Noya",1439244000.0],[465,"<SQL> If theree isn't a reborn update today, i will chop off my dick with a kitchen knife and stream it.","Perry",1439244000.0],[466,"<BMD> just accept that i'm right","Infekma_",1439416800.0],[467,"<Jeff_Hill> I really can't make forward looking statements on IRC. If I promise something but we don't ship it, I've done a bad thing for you. If I promise we won't do something, but then we do, it's also a problem for you. It's best for everyone this way, really.","Noya",1439503200.0],[468,"▄█▀ █▬█ █ ▀█▀","Yackback",1439676000.0],[469,"<Perry> yeah, there's particles and there are perry particles","Noya",1439676000.0],[470,"<Phanterm> Toyoka: So what kind of work do you do? :o You said 'artsy' so I'm curious. <Aleteh> He does futa drawings of dota characters","Noya",1439676000.0],[471,"<Toyoka> JUST, FO IT","SinZ",1439676000.0],[472,"<DarkMio> in the end, there is some good historical advice: don't trust the fake german","Noya",1439762400.0],[473,"<SQL> rip Noya, he's never there when i cum","BMD",1439848800.0],[474,"<func_door> modders are sensitive creatures who will bite your fingers if provoked","Noya",1439848800.0],[475,"<func_door>\tthey call him jeff hill but he's a mountain of a man","Myll",1439848800.0],[476,"<BMD> i don['t know waht you're doing at all | but it sounds like you're doing it wrong","gigimoi",1440108000.0],[477,"kappa || keepo","Noya",1440108000.0],[478,"<SQL> if you want to flame people for doing nothing you should start with me","Noya",1440108000.0],[479,"<SQL> the thing is, we usually never have fucking cocks in finland","Hewdraw",1440108000.0],[480,"<Aderum> sql free playtesting from you is kinda like offering a free rectal exam","Perry",1440367200.0],[481,"<Rabscuttle> In Windows 7/10 pasta, needs more memes.","Noya",1440367200.0],[482,"<Perry>\tthe jimmydorry army has arrived ||<+SinZ>\twe don't need to watch finding dory now","Myll",1440540000.0],[483,"<Tischel> poorly coding should be penalized by the law","Noya",1440540000.0],[484,"<BMD> lua experience isn't evne that helpful here","DrTeaSpoon",1440540000.0],[485,"<func_door> you probably shouldn't listen to sql's reports on things I think he's wrong more often than not","Perry",1440626400.0],[486,"<penguinwizzard> VicFrank: yeah, but it's not a firehose of shit right at your face :/","VicFrank",1440712800.0],[487,"<SQL> +8ball Will everyone eventually get banned on this bot? || <Rabscuttle> You may rely on it","gigimoi",1440972000.0],[488,"<SQL> google uses Tables almost solely for storing stuff in their database","Noya",1440972000.0],[489,"<Infekma> Give me pot noodle and reggea and i'll focking code you the moon","Noya",1441058400.0],[490,"<VicFrank> I google search every time I want to write a for loop","Myll",1441058400.0],[491,"<Rabscuttle> ROFLMAO go back to cleaning toilets","Perry",1441058400.0],[492,"<DR-18> seemed stupid so i didnt look too deeply into it, and perpetuating the circle","RoyAwesome",1441144800.0],[493,"<penguinwizzard> common UI frameworks often suffer from compounding feelings of \"sameness\"","DarkMio",1441144800.0],[494,"<BMD> it's the weird looking glasses guy \"^(.*)_(.*)&\"","Perry",1441144800.0],[495,"<Xentor> SQL... I have computers older than you","Noya",1441317600.0],[496,"<Tischel> =memo Noya fak u","Dun1007",1441404000.0],[497,"<Ricochet> make mods, not war","Noya",1441490400.0],[498,"<BMD> why aren't you all such insufferable asshats that you can't work with people ||<BMD> that works ok for me","SQL",1441490400.0],[499,"<Arhowk> oh no hold on i fucked that ex. up","DarkMio",1441576800.0],[500,"<SinZ> #rebornfor9/11","DarkMio",1441749600.0],[501,"RiotExgeniar: I can probably fix it within a month.","Noya",1441749600.0],[502,"gigimoi this channel is immune to any off topic","fcalife",1441749600.0],[503,"pls good quote rabboy!","fcalife",1441749600.0],[504,"<penguinwizzard> you should really try to get good at playing with yourself","Hewdraw",1441749600.0],[505,"<Ricochet> oh boy, gfys are pretty much the only reason I am always idling in this channel","Noya",1442008800.0],[506,"<BMD> shoiulkd be klickety split","SQL",1442095200.0],[507,"<Rabscuttle> DarkMio doesnt directly mod anything. He is drugs.","DarkMio",1442268000.0],[508,"<Azarak> but Steve, he has different unit names, we can't sue him!","Noya",1442354400.0],[509,"<@BMD> if you know how computers actually work ||<@BMD> they can't be better than just doing a loop ||<@BMD> becuase they do a fucking loop","Myll",1442527200.0],[510,"<penguinwizzard> hopefully there'll be rare earth metal shortages soon so that cpu costs go up ||<penguinwizzard> and we start seeing code quality again","SinZ",1442527200.0],[511,"<VicFrank> sorry, this channel is only for discussing hearthstone","Noya",1442700000.0],[512,"<Azarak> bmd is the hooker guy","Noya",1442700000.0],[513,"<d2imba> goddamn it, those pants were new","Noya",1442786400.0],[514,"<DarkMio> MI GATO DOES MIAU MUCHO 'CUZ MI GATO ES HUNGRY AS FUCK","Noya",1442786400.0],[515,"<+Drakonis> DoctorGester, purple void for star platinum","penguinwizzard",1442959200.0],[516,"<func_door> sql is cramming the whole chat into his clowncar and driving it off a cliff","Noya",1442959200.0],[517,"<Noya-_-> I thought CS5 was some mix of HTML5 and CSS","SQL",1443132000.0],[518,"<VicFrank> it was just me and 1 other dude, and he wouldn't finish me off. so I did it myself","Noya",1443304800.0],[519,"< sadtaco> Nothing wrong with JS. You learn about VMs.","penguinwizzard",1443304800.0],[520,"<penguinwizzard18> when I was 6 my mom sat me down and taught me C89 using an old borland compiler","Noya",1443304800.0],[521,"<sadtaco> All the 10k mmr stack coders ignoring me.","FrenchDeath",1443391200.0],[522,"<Perry> travelling salesman problem? no problem, just store all permutations in a KV table","Noya",1443391200.0],[523,"<Tischel> BUT THE CODE MUST BE CLEAN","Perry",1443477600.0],[524,"<rabs> \"Kindly get the fuck off my post.\"","wigguno",1443564000.0],[525,"only the dead can know peace from this evil","BumDev",1443564000.0],[526,"<penguinwizzard> modding works best on solaris [..] more seriously though, ignore literally everything I just said","Noya",1443650400.0],[527,"someone get me fired at my job please.","BumDev",1443650400.0],[528,"<Rabscuttle> Uhh what are you, a bot?","Perry",1443736800.0],[529,"<DarkMio> Germans tell telltales of killing jews to gain a secret time powder. <DarkMio> once we went out of jews, we started to lose the war, too.","FrenchDeath",1443736800.0],[530,"<VicFrank> at the moment, I just assume that if your name starts with the letter 'a', you're working on an rpg","Noya",1444082400.0],[531,"<Tischel> all i know is that daniel broke panorama and ran away","Noya",1444082400.0],[532,"<BMD> it's really hadr to make games that don't suck","Noya",1444255200.0],[533,"<+Noya> penguinwizzard, do you have a banner ||<@penguinwizzard> !kb Noya I am a banner","penguinwizzard",1444341600.0],[534,"Noya I dont know what a hashset is","DoctorGester_work",1444341600.0],[535,"<Aardvark> when darkmio isn't in the house rabs breaks into his liquor cache","SQL",1444341600.0],[536,"<RoyAwesome> I have never heard anyone refer to hammer as 'VHE'. I've heard 'Forge', 'Hammer', 'Fucking piece of shit fuck this shit fuck valve fuck hammer', and 'You fucking did what with carve?!?'. But never 'VHE'.","Noya",1444428000.0],[537,"<@BMD> in the year 20XX, all games are determined by making your opponent feel more awkward","Myll",1444514400.0],[538,"<FrenchDeath> i fell like i'm getting rekt by unknowledge","Noya",1444514400.0],[539,"<DarkMio> I guess you get a double star for special autists if you do it in matlab","Noya",1444514400.0],[540,"<Arhowk> this is why i tried to get ppl to help but ppl are all worthless","Noya",1444600800.0],[541,"<@BMD> look at the confusion everyone has over fucking ability:GetCursorPosition ||<@BMD> everyone initially thinks it'll give them mouse position","Myll",1444600800.0],[542,"<VicFrank> Game Development For Idiots doesn't quite have the same ring to it as modding","Noya",1444687200.0],[543,"<SinZ> jimmydorry_work: MyLitttlePredator ||<Rabscuttle> True. Source: I have the female equivalent.","SinZ",1444687200.0],[544,"<+Noya> \"Guys I've put BETA on the name dont bother me\" ^_^","Myll",1444687200.0],[545,"<@BMD> you clearly don't even undrestand what it means to rotate a particle","Tora",1444687200.0],[546,"<@BMD> jesus h tittyfucking christ on a cracker","Myll_",1444687200.0],[547,"<Aardvark> we all need bear fuck beer sometimes","SQL",1444687200.0],[548,"<ScOULaris> BMD is more like the Old Testament gods. Quick to smite people if they step out of line.","Noya",1445275251],[549,"<kallisti> Haskell is my favorite imperative language.","Noya",1445315476],[550,"<BMD> it's the programming equivalent of being molested as a child and going on to molest others","VicFrank",1445315632],[551,"<+Noya> name it Yoda and make the calls like: functionName end start }{","Myll",1445316246],[552,"<+BMD> so \"i banged \\\"your mom\\\", but later found out it was your dad","Dun1007",1445323709],[553,"<VicFrank> how can spaces be real ||<Toyoka> because our eyes are mirrors <jimmydorry> of the soul","jimmydorry_work",1445385914],[554,"<space_jam> just ignore me tbh i shouldn't be taken seriously by anyone","jimmydorry_work",1445480823],[555,"<SQL> you're literally so good i'd pay to suck your cock","Noya",1445718743],[556,"<+BMD> local newObject = oldObject is not a copy <+BMD> what are you smoking","Myll",1445744591],[557,"< Rabscuttle> How do you milk a cat?","penguinwizzard",1445757418],[558,"<@penguinwizzard> and rails caught on because the web is a silly place where we'd rather not go","Aardvark",1445923899],[559,"<Perry> UML has state diagrams? lolwtf","Noya",1446057506],[560,"<Rabscuttle> Cat science? You have a cool dad","Perry",1446148769],[561,"<+BMD> gotta make Tentacle Surprise 6: Handicapped Girls Can't Get Away","Aardvark",1446157752],[562,"<berz3rk> Aardvark:I dont want to script <berz3rk> I dont get why I have to script this","gigimoi",1446168042],[563,"<+DarkMio> +markov Tell that fuck what you think. ||<Rabscuttle> \"Fuck fuck fuck fuck\"","Aardvark",1446235839],[564,"<BMD> noya make my mod, i'll pay you in +quotes","Noya",1446261180],[565,"my programming music consists of the whole Black Sabbath and Judas Priest discography, whenever it ends it means I've already spend too much time in front of the computer","Myll",1446318618],[566,"<ZzZombo> but you can keep pressing me into becoming a retard","gigimoi",1446341040],[567,"<Perry> there's an array of monkeys playing dota to find bugs ||<Perry> PETA is not pleased but valve does not care","DarkMio",1446404650],[568,"<Drakonis> also i read homestuck, how hard is it to read ulysses","VicFrank",1446430315],[569,"<SQL> DarkMio isn't here spam the quotes","Aardvark",1446462883],[570,"<Aardvark> we observed a wild penguin in a peculiar ecosystem that thrives on shit and memes. . . these findings have major implications to how we think about and model flightless avian social behaviors","Myll",1446496304],[571,"<+BMD> why bother not knowing things ||<+BMD> when you can know them","func_door",1446576588],[572,"<+BMD> it's a print ||<+BMD> it prints ||<+BMD> or your code didn't get there ||<+BMD> debugging 101","Myll_laptop",1446576684],[573,"< jimmydorry_work> length is more important that width, I guess","penguinwizzard",1446607871],[574,"<+BMD> that's why BMD has always stood for Big Motherfucking Dick","Myll_lap_",1446608192],[575,"wow you guys suck for this design decision in your game you should be ashamed of yourself OH WELL GONNA BUY IT ANYWAYS","Noya",1446748126],[576,"<Strong> i don't think so, the game doesn't run javascript","Aardvark",1446928525],[577,"<Naurgul> Rabscuttle: there is no context in what you're saying, you're saying that only to make me think you guys were discussing murder before I showed up, right?","Noya",1447008582],[578,"<+Noya> just look at this guy, 12k posts still making suggestions to valve http://dev.dota2.com/showthread.php?t=184608","Myll_laptop",1447078137],[579,"<BMD> just pastebin your code or something <BMD> so i can fix it and you can stop hurting your brain","Myll",1447273308],[580,"<+Drakonis> i don't write poorly unless i'm joking","func_door",1447280234],[581,"<kallisti> it's only a matter of time before I implement the entire Haskell standard lib in Javascript","SQL",1447350471],[582,"<BMD> granted anyone triyng to make an established game as a dota mod is insane","Noya",1447359565],[583,"<Perry> I've been doing this for like 20 months and still have no clue what I'm doing","Noya",1447359913],[584,"<+Noya> I'm not signing any DNA what the fuck","Aardvark",1447427450],[585,"<Aardvark> stop oppressing my quad-testicle dragonkin shitlord","Noya",1447525735],[586,"<Perry> \"The Swedish government is not releasing any exact data, but some guy told me SQL is 80% retarded.\"","Aardvark",1447699364],[587,"<Aardvark> les moderables, an epic compilation of the tales of the suffering modders go through to make dota 2 custom games","Myll_laptop",1448050428],[588,"<gigimoi> nobody really knows what quaternions are","VicFrank",1448075942],[589,"<+Toyoka> BLOOD FOR THE BLOOD GOOD","Aardvark",1448134251],[590,"<Perry> UML is cool, UML assignments suck","Noya",1448215090],[591,"<+Noya> into ded.dota2 you go","Aardvark",1448234674],[592,"<|ChalkyBrush|> WCIII is best game of all time. It got me into PC gaming. RTS with RPG ELEMENTS blew my tits off!","jimmydorry_work",1448337727],[593,"<Myll> holy shit i just had an idea... load your webpage in panorama during CUSTOM_GAME_SETUP and make money from adsense","Noya",1448405129],[594,"<+Noya> couldn't care less of how you germans lay eggs","Aardvark",1448465214],[595,"<UncertainCat> on the bright side, if you get reconnect support fully working you'll be surpassing WCIII","Myll_laptop",1448508809],[596,"<ldrancer> yep im a develpoper i deserve my money. and screw your speech i want to use the internet and if i can abuse it noone will use it||* ldrancer has quit (Quit)","DarkMio",1448570057],[597,"<Aleteh> this makes me moist <Toyoka> I am amazed <Rabscuttle> Aw, I am too.","Noya",1448647101],[598,"<Drakonis> tool updates resuming in the next major patch","DarkMio",1448665203],[599,"<BMD> oh god it's happening again, i'm going to drop all the publicity into nothing","Noya",1448922226],[600,"<SinZ> VicFrank: No mod deserves not to have stats","VicFrank",1448939171],[601,"<+Noya> Arrays are a lie","Aardvark",1449008313],[602,"< Ricochet> if a model doesnt have a properly modelled butthole i just dont consider it finished","penguinwizzard",1449013497],[603,"<Toyoka> what is wrong with me ||<Toyoka> oh wait, nothing, I'm Canadian","Noya",1449018107],[604,"<Toyoka> if I mapped for all my time, I'd probably be eating own shit in an asylum by now","Myll_",1449025293],[605,"<+BMD> now i just need to somehow get a critical mass of players <+BMD> before i hit a critical lack of players","Myll_laptop",1449065555],[606,"<Perry> saying SQL is the best dota modder is like saying Jesus was a pretty average messiah","Noya",1449090127],[607,"<Noya> wait lua abilities can't be SetToggle'd? <Rabscuttle> Lol. I can't imagine it any other way.","gigimoi",1449096716],[608,"<+BMD> that was the map i made in like 6 seconds <+BMD> literally click and uneven drag my dick across the tile tools","Myll_laptop",1449209248],[609,"<BMD> i juist abandoned this channel for a week || <BMD> so i could stop aggressively hating all of you so much for being so goddamn stupid all the time","cyba",1449253003],[610,"<Cyborgmatt> noya is icefrog","SQL",1449328361],[611,"<Divayth> hearthstone is super stupid for competetive play but blizzard gets away with it","Myll",1449352478],[612,"<+Noya> because people + dota is a terrible combination in the first place","Myll_laptop",1449418232],[613,"<BMD> seriously, i spend about 10% of my time now actually working on sota and 90% just rocket jumping around the caldera map","Noya",1449444810],[614,"<+BMD> i'm talking about jacking off santa while giving frosty the reacharound","Aardvark",1449444833],[615,"<Crescent> a memelord travels through memespace and memetime with his trusty companion, in the MARDIS which stands for Meme And Relative Dimension In Shitpost","Noya",1449447382],[616,"<Rabscuttle> In a couple years i see venison sticks","VicFrank",1449528858],[617,"'When you're developing software, it's good to remember women still exist.' - Perry's teacher","cyba",1449584596],[618,"<func_door> the quote library needs a strong purge of unfunny quotes","Noya",1449881217],[619,"<DoctorGester> Putin will protect me in case they sue me","Noya",1450024752],[620,"<func_door> you'll never make more than 10 thousand particles... unless EE plays your custom","Myll",1450208543],[621,"<Noya> if ETD doesn't get dedis I will stream myself eating a printed version of the source code","Hewdraw",1450314436],[622,"<DoctorGester> yeah arc warden was a sunsfanside job","DarkMio",1450569486],[623,"<FrenchDeath> http://prntscr.com/9gs299 way back to n#1 mod","Noya",1450704273],[624,"<Infekma> i'm about to get my shit pushed in aren't i","Noya",1450751900],[625,"<func_door> if you don't get your balls busted you can never be the one busting balls || <func_door> well, on the bright side, if you mod, you get to bust all the balls","Noya",1450900672],[626,"<Dun1007> so im playing the first dota 2 game in 2 months, what should i know <a_dizzle> play slide ninja slide","Dun1007",1450997890],[627,"<+DarkMio> my german mother tongue fucked me","DarkMio",1451514106],[628,"< Frozenhelfire> -createhero ursa enemy < npc_dota_ursa> Frozenhelfire: fuck you","penguinwizzard",1451612372],[629,"<gigimoi> somebody make a python -> lua transcompiler for me so that I can get back into dota 2 modding again plz","DarkMio",1452115348],[630,"<Toyoka> Toyoka from Toronto riding a Toyota made in Tokyo","Perry",1452631588],[631,"<Darthseid>\tBMD, you mentioned yesteday to EntIndexToHscript(RandomInt(0,65535)) , how would that only get items?","Myll_laptop",1452648637],[632,"<Rabscuttle> Turns out, my friend's dad is dead.","Perry",1452955881],[633,"<func_door> my momma doesn't know shit about resource precaching","Noya",1453139779],[634,"<a_dizzle> I had a dream where myll posted a element td thread on reddit saying it was ready or whatever, and I was like noooo we are not done yet||<a_dizzle> then I wake up today thinking it was real for a second and tried looking for the thread","Noya",1453495549],[635,"<Ash47> so, I need to do a bunch of floating cocks around my name","SinZ",1453773761],[636,"LETS NOT FORGET THAT RENOL STORES THE CURRENT BETS","DarkMio",1453836275],[637,"<BMD> legacy key users are the video game equivalent of stockholm syndrome","Noya",1454013169],[638,"<Noya> !navalwarfare 524239685","BMD",1454105270],[639,"<+BMD> at least everyone i've ever met had the sanity not to use C++ exceptions","Dun1007",1454458006],[640,"<SQL> seriously interface designing must be how people are tortured in hell","Noya",1454718170],[641,"<Noya> actually that font is awful lets get some comic sans","VicFrank",1454792691],[642,"<BMD> you could play angel arena by snail mail if you wanted","Noya",1454897905],[643,"<+BMD> Greetings Angel Arena server, if you would kindly ensure that my character continues to farm these enemies for the next few days, I would greatly appreciate it. You see, I have contracted pancreatic cancer, and will be undergoing chemotherapy for a few months, and hope thay my character will remain in good health, even if I may not.","Dun1007",1454898041],[644,"<+BMD> picture the game played by a lobotomized gopher <+BMD> how far can they get","Myll_laptop",1454899163],[645,"<VicFrank> ahh, LX, when people actually played our games","Dun1007",1454903344],[646,"<Darthseid> Well, I have 3$ in my wallet. What will that get me? <+Noya> add 22 cents more and you can teach twitch chat some memes","Dun1007",1454968793],[647,"<+Noya> could be useful? perhaps. Will it happen? less likely than valve updating their docs","Dun1007",1455040567],[648,"<func_door> \"just get friends that aren't complete assholes\" ha ha yeah right buddy easier said than done everybody is an asshole","Perry",1455134687],[649,"<+BMD> i'm king motherfucking kong","func_door",1455149542],[650,"<Darthseid> I thought this was a community of boundary pushers who's motto is \"The sky is the limit.\"","Noya",1455225442],[651,"<JamesRossi> Anyway this place is, like intensely hostile. So good luck hating each other I guess.","Noya",1455297783],[652,"vim is #1 in text editor-based stockholm syndrome","Darthseid",1455325076],[653,"<SQL>anyone pls hire me||<Perry>you need skills to get hired","Perry",1455395355],[654,"<SQL> speaking of fetishes","Perry",1455396141],[655,"<DoctorGester_work> lua is written in clientside lua","Noya",1455550403],[656,"obviously Cyborgmatt has been sending all this money to ISIS","Darthseid",1455767293],[657,"<LK_> by the way, i dont know who made elemental TD, but i love that damn map <+func_door> it was made by cyborgmatt <LK_> deleting it","Myll_laptop",1456187244],[658,"<SinZ> I didn't earn my title of least relevent person by playing eletd all day","Noya",1456277733],[659,"<DoctorGester> I just ignore SQLs messages man they make no sense 99% of the time","DarkMio",1456340165],[660,"hail satan","func_door",1456340236],[661,"<Toyoka> it's going to give me an neurysm","gigimoi",1456453579],[662,"<GabeN> James is an ass","func_door",1456534043],[663,"<asdfr> Hello I want to understand how can I get statistics igry.No can not understand how I do it, you could not help, it may advise the necessary sequence of actions? I would like to receive the following statistics on its web page that manually create. Please help they Пожалуйста объясните как я могу получать статистику игры дота 2 к себе на страницу?","BMD",1456734235],[664,"<Rabscuttle> i hope i never do something this degrading again","BMD",1456782669],[665,"<BMD> yeah man, i heard \"SendToConsole\" on client and immediatley went to international match fixing and bribery","Noya",1456796513],[666,"<Noya> don't worry what I said I say random bullshit all the time","vyrus",1456891808],[667,"<BMD> get your hand out of your pants and your face out of a garbage bag full of gasoline","Myll",1456968488],[668,"<jimmydorry> aisle, bar on the floor, djembe, ian, zounds, zounds, llama, eye ... yes that spells a_dizzle","jimmydorry_work",1456990794],[669,"<Rabscuttle> I ate about 12 wings of the lecture.","DarkMio",1457117573],[670,"<Noya> Dungeon Keeper <\bVicFrank\b>\b oh yeah, that mobile game","Noya",1457137553],[671,"<Myll_lap> well it's mainly about the up and down movement with the forearm","vyrus",1457141268],[672,"<Perry> I'm on the verge of Boolean meltdown here","Noya",1457287945],[673,"{BMD} you can't even comprehend what we can or can't do","jimmydorry_work",1457322446],[674,"<penguinwizzard> please direct any complaints about uptime to BMD","VicFrank",1457660537],[675,"<\bspace_jam\b>\b ur too late bmdoodoo toyoka is new bmd","Noya",1457917847],[676,"<func_door> volvojob sounds erotic","Noya",1458074223],[677,"<func_door> uncle sam needs to loosen up w/r/t loli catgirls imo","Perry",1458156856],[678,"\b<\bNoya\b>\b The feel when you can remember modders name but not my class mates names","SQL",1458243724],[679,"<DarkMio> I'm sorry, but have you checked out my degree in armchair lawyerinism?","Noya",1458247141],[680,"<+BMD> as i said in the other channel, i really would not be surprised if Darkswordfish ran addon_english.txt through turnitin.com","jimmydorry_work",1458258752],[681,"<jimmydorry> distracting people from noticing GDS lost a month's worth of data","Noya",1458779158],[682,"<+Perry> don't mind SQL nobody knows why he's here","Myll_laptop",1458914866],[683,"<+BMD> when i clicked on the dark souls 3 season pass <+BMD> all of the \"recommended similar games\" were those weird anime dating things","Dun1007",1459537690],[684,"<berz3rk> programming is not about trying out things a million times but constructive thinking","Noya",1459792193],[685,"<Core> Oh, you think anime is your ally. But you merely adopted the anime; I was born in it, moulded by it. I didn't see the light until I was already a man, by then it was nothing to me but ANIME!","SQL",1459947590],[686,"<SQL> everything is funny if you're dumb enough; <SQL> Plz señor lizardo","Perry",1460490606],[687,"BMD: most people in here are extremely bad at dota, no suggestion is too stupid to be seen as sarcasm by default","wFX",1460739992],[688,"<DoctorGester_work> that was sql* <vyrus> well ... they both start with an s and have a minimal number of characters","Dun1007",1460914269],[689,"<berz3rkerer> if blizz hires me I stop mod development xD","vyrus",1461258933],[690,"Firetoad Noya: every time you speak you become my hero","Firetoad",1461614504],[691,"<BMD> people are aggressively stupid lately","Noya",1461853845],[692,"<narake> BMD: thank you very much for your support. you are a nice human :D <BMD> that's not even remotely true","Myll",1461873670],[693,"<McKay> Valve's Razor: If something sucks and Valve is involved, it's Valve's fault.","DarkMio",1461880893],[694,"<DarkMio> Jewdraw","Noya",1462723504],[695,"\"I suggest to find this motherfuckers by IP and cut their throats, not perfect, but fuck me man, it can works out.\" -ShutnikMods","Noya",1462794217],[696,"<BMD> one of the benefits of being dangerously insane: i don't need to believe there's hope on the horizon","Noya",1463025076],[697,"<DoctorGester> anal = ass","Perry",1463427732],[698,"<BMD> it's like christmas over here <BMD> i got vindication over all the people who don't know what they're fucking doing","vyrus",1463604480],[699,"<SQL> i'm probably just retarded, pls ignore","VicFrank",1463759591],[700,"<DoctorGester> so it's either bullshit or fucking bullshit","Dun",1464462907],[701,"<SQL> i'm upvoting every single post about dota 2 API's being down forever until Valve actually fixes them || <Ricochet> do you even need the api? || <SQL> no","DarkMio",1464730352],[702,"{jimmydorry} If it were close, we would have seen swapping in leads... but we haven't seen this for any pair so far. I'm assuming it's going to be a huge blow out. Wisp will beat PL.","jimmydorry",1465177386],[703,"<Dun> its a shame dota 2 is more ded than club penguin in KR","DarkMio",1465329066],[704,"<DoctorGester> https://git.io/vomIY how elegant is that || on a scale from javascript to C#","Noya",1465407620],[705,"<BMD> it is unique <BMD> but so is a peanut butter and placenta sandwich","Dun",1465515141],[706,"<SQL> see i'm a genius","DarkMio",1465586628],[707,"<idler2> DoctorGester: Your !dotaplayers request has timed out <DoctorGester> your mom's timed out","Dun",1465888933],[708,"<Toyoka> but yea, essentially taking several photos of a model in different angles and virtualizing it <DoctorGester> capture urself we need a new pudge model anyway","vyrus",1466211466],[709,"<DoctorGester> I convert water into wine through world panels, got any problem with that?","Noya",1466966717],[710,"<SQL> if i never join this channel again remember me as the dude who got killed by fever","vyrus",1467070437],[711,"<DoctorGester> noya is a robot created specifically for dota modding and GoT watching purposes","Noya",1467486966],[712,"Perry : there are like 4 people I would actually trust to be able to write proper code","FrenchDeath",1467992114],[713,"<Toyoka> MARK MY WORDS","BMD",1468281915],[714,"<BMD> communism is hardcore shit","idimod",1468541342],[715,"<VicFrank> oh I see... you actually have to save files for them to change...","vyrus",1468635932],[716,"<SQL> too bad that place is 90% africans 10% finnish these days","Perry",1468951124],[717,"<Noya> why is that a quote","vyrus",1469031499],[718,"SQL so who careas, animals are gucci people","Toyoka",1469225402],[719,"<BMD> you have your dangerously insane people like noya who are good as fuck at drawing naruto yaoi","VicFrank",1469236831],[720,"<jimmydorry> we could probably get a team of crows to make a GOTD mod","Noya",1470054128],[721,"<DarkMio> this is just shitting on someones chest, write \"I <3 you\" with your tongue in it, piss it clean and fart it dry all at once","SinZ",1470268957],[722,"<etofok> I have no context and this is confusing af","VicFrank",1470526328],[723,"<func_door> vote io for president and give trump arcana","Perry",1470775774],[724,"[TI6, EHome vs DC, Minute 23:30] <Aleteh> Sounds like a faggot furry convention","DarkMio",1470963323],[725,"<DoctorGester> slacks IS pitlord","Myll_laptop",1470970226],[726,"<penguinwizzard> npm has a million devs, but lua has a brazillian","Perry",1471029366],[727,"<Perry> it's in the quote index so must be true","BMD",1471032341],[728,"<Perry> I mean WC3 is basically stand-alone dotacraft","Noya",1471361377],[729,"Robert Virding, who developed Erlang with me, was famed for his comment. Singular. The entire stuff he wrote had one comment: in the middle of the pattern-match compiler there was a single line saying ‘and now for the tricky bit’.","DarkMio",1471445545]]